package entity

type Area struct {
	ID   int64
	Name string
}

func ListAreas() []Area {
	return []Area{
		{1, "関東地域"},
		{2, "中部地域"},
		{3, "関西地域"},
		{4, "中国・四国地域"},
		{5, "九州地域"},
	}
}

type Observatory struct {
	ID         int64
	Prefecture string
	Name       string
}

func (e Area) ListObservatories() []Observatory {
	switch e.ID {
	case 1:
		return []Observatory{
			{1, "茨城", "水戸石川一般環境大気測定局"},
			{2, "茨城", "日立市消防本部"},
			{3, "茨城", "国立研究開発法人 国立環境研究所"},
			{4, "栃木", "宇都宮市中央生涯学習センター"},
			{5, "栃木", "栃木県那須庁舎"},
			{6, "栃木", "日光市役所第４庁舎"},
			{7, "群馬", "群馬県衛生環境研究所"},
			{8, "群馬", "館林保健福祉事務所"},
			{9, "埼玉", "さいたま市役所"},
			{10, "埼玉", "熊谷市保健センター"},
			{11, "埼玉", "飯能市役所"},
			{12, "千葉", "東邦大学"},
			{13, "千葉", "千葉県環境研究センター"},
			{14, "千葉", "印旛健康福祉センター成田支所"},
			{15, "千葉", "君津市糠田測定局"},
			{16, "東京", "東京都多摩小平保健所"},
			{17, "東京", "新宿区役所第二分庁舎"},
			{18, "神奈川", "神奈川県庁第二分庁舎"},
			{19, "神奈川", "川崎生命科学・環境研究センター"},
			{20, "神奈川", "神奈川県環境科学センター"},
			{21, "神奈川", "辻堂"},
		}
	default:
		// TODO
		return []Observatory{}
	}
}
